          <I>Introduction</I> :<BR>
          <P>En d&eacute;cembre 2000 VIA annon&ccedil;a son nouveau Southbridge 
            686B, en m&ecirc;me temps que le chipset KT133A. Le nouveau Southbridge 
            diff&egrave;re de ses pr&eacute;d&eacute;cesseurs par un support natif 
            de l'ATA100. </P>
          <P>Avec ce nouveau Southbridge et les cartes m&egrave;res KT133A, diff&eacute;rents 
            utilisateurs ont rencontr&eacute; des probl&egrave;mes de corruption 
            de donn&eacute;es et d'instabilit&eacute; syst&egrave;me lors de transfert 
            de fichiers, de l'&eacute;coute de musique, ou de toute action utilisant 
            le bus PCI. D'une mani&egrave;re g&eacute;n&eacute;rale, les utilisateurs 
            dot&eacute;s de chipset KT133A, du SouthBridge 686B et de carte son 
            Sound Blaster Live ont &eacute;t&eacute; affect&eacute;s. </P>
          <P>Nos tests montrent que ce probl&egrave;me n'est pas limit&eacute; 
            aux SBLive!, mais que les syst&egrave;mes comportant des cartes Audigy 
            peuvent aussi rencontrer des probl&egrave;mes. Pire encore, avec une 
            syst&egrave;me affect&eacute;, le pilote kX est susceptible de ne 
            pas &ecirc;tre reconnu par le package des pilotes VIA 4in1, indiquant 
            par l&agrave; que le correctif VIA n'est peut &ecirc;tre pas correctement 
            install&eacute;. </P>
          <P>Les correctifs fournis par les constructeurs de BIOS et par VIA ne 
            mettent pas compl&egrave;tement fin &agrave; ce probl&egrave;me. M&ecirc;me 
            apr&egrave;s avoir corrig&eacute; les probl&egrave;mes de corruption 
            de donn&eacute;es vous risquez toujours de rencontrer des craquements 
            lors de la copie de fichiers, de la gravure de c&eacute;d&eacute;rom 
            ou du transfert de donn&eacute;es via le r&eacute;seau. </P>    
          <P>Cependant nous avons trouv&eacute; une solution qui r&eacute;sout 
            compl&egrave;tement ce probl&egrave;me. Cette solution n&eacute;cessite 
            de suivre les &eacute;tapes suivantes :<BR>
      <UL>
            <LI>Connectez vous sur le site du constructeur de votre carte m&egrave;re 
              et t&eacute;l&eacute;chargez le dernier BIOS de votre carte, 
            <LI>Connectez vous sur le site de VIA et t&eacute;l&eacute;chargez 
              les derniers pilotes Via 4in1, 
            <LI>Installez le correctif (patch) 'George's PCI Latency' (c'est la 
              seule solution pour r&eacute;soudre ce probl&egrave;me dans certains 
              cas). </LI>
          </UL>
      <P></P>
          <I>Qui a besoin de ce correctif ?</I><BR>
          <P>Toute personne utilisant une carte m&egrave;re bas&eacute;e sur le 
            686B, quel que soit le syst&egrave;me d'exploitation utilis&eacute;. 
          </P>
          <I>Conclusion</I> :<BR>
          <P>Nous vous conseillons d'utiliser le correctif 'George's PCI Latency' 
            version 0.19 disponible <A class=fade href="http://download.viahardware.com/vlatency_v019.zip">ici</A>*.<BR>
            Vous devez &eacute;galement installer les derniers pilotes VIA disponibles 
            <A class=fade href="http://www.via.com.tw/" target=_blank>ici</A> et mettre &agrave; jour 
            le BIOS de votre syst&egrave;me. <BR>
            <BR>
            <I>R&eacute;f&eacute;rences</I> :<BR>
      <P><A class=fade href="http://www.viahardware.com/686b_1.shtm" target=_blank>http://www.viahardware.com/686b_1.shtm</A> </P>
      <H5>
      <HR>
            * Le lien doit &ecirc;tre correct, cependant il est possible que vous 
            deviez utiliser <A class=fade href="http://www.viahardware.com/" target=_blank>http://www.viahardware.com/</A> pour obtenir ce fichier.
