<title>Reporting Bugs</title>
<link rel="stylesheet" type="text/css" href="style.css" />
<style src="style.css"></style>

<h4>
          <P>Les rapports d'anomalie nous aident &agrave; identifier et &eacute;liminer 
            les ennuyeux bogues logiciels. Le pilote kX et ses applications p&eacute;riph&eacute;riques 
            n'ont pas &eacute;t&eacute; test&eacute;s sur l'ensemble des combinaisons 
            possibles de syst&egrave;mes d'exploitation, de mat&eacute;riel et 
            de logiciel. Vos rapports d'anomalie repr&eacute;sentent donc une 
            partie importante du processus de d&eacute;veloppement. </P>    
          <P>Avant de remonter une anomalie, v&eacute;rifiez que vous utilisez 
            bien la version la plus r&eacute;cente des pilote et consultez la 
            liste <? klink("issues"); ?>probl&egrave;mes connus</A> ainsi 
            que le <? klink("changes"); ?>suivi des &eacute;volutions</A>. 
            Si vous avez trouv&eacute; une anomalie non encore r&eacute;pertori&eacute;e, 
            alors par tous les moyens, faites nous le savoir ! </P>
          <BR>
          Les rapports d'anomalie doivent comporter les informations suivantes 
          : <BR>
          <P>- Informations concernant le pilote kX. Ces informations peuvent 
            &ecirc;tre r&eacute;cup&eacute;r&eacute;es en cliquant sur l'ic&ocirc;ne 
            information ("i") dans la fen&ecirc;tre du mixeur kX, ou via un clic-droit 
            dans l'ic&ocirc;ne syst&egrave;me du pilote kX en s&eacute;lectionnant 
            &quot;A propos ...&quot; ; puis &agrave; nouveau un clic-droit sur 
            l'arri&egrave;re plan et choisir &quot;s&eacute;lectionner tout&quot; 
            ; une nouvelle fois un clic-droit puis s&eacute;lectionner 'copier' 
            dans le menu ; coller les informations du pilote kX dans votre rapport. 
          </P>
          <P>- Informations concernant le syst&egrave;me d'exploitation et la 
            carte son. Indiquez la version du syst&egrave;me d'exploitation, les 
            &eacute;ventuels 'Service Pack' install&eacute;s, ainsi que le nom 
            de la carte son, le mod&egrave;le et la r&eacute;vision, et une description 
            des extensions particuli&egrave;res (e.g. LiveDrive II, etc.). </P>
          <P>- G&eacute;n&eacute;ralit&eacute;s sur l'incident. Donnez assez de 
            d&eacute;tails sur le probl&egrave;me afin qu'il puisse &ecirc;tre 
            identifi&eacute; et d&eacute;crit de mani&egrave;re unique.</P>
          <P>- Comment reproduire l'anomalie. Quelle est l'encha&icirc;nement 
            exact qui permet de reproduire le probl&egrave;me ?</P>    
          <P>- R&eacute;sultats attendus et obtenus. Quels &eacute;taient les 
            r&eacute;sultats que vous attendiez de l'op&eacute;ration effectu&eacute;e, 
            quels ont &eacute;t&eacute; les r&eacute;sultats effectivement obtenus 
            ? </P>    
          <P>- Criticit&eacute; de l'anomalie. D&eacute;crivez l'incident conform&eacute;ment 
            au niveau de s&eacute;v&eacute;rit&eacute; que vous lui attribuez 
            (dans l'objet de votre rapport): </P>
          1. Majeur : Les anomalies provoquant des red&eacute;marrages, des blocages, 
          des fuites de m&eacute;moire ou provoquant des pertes ou corruption 
          de donn&eacute;es.<BR>
          2. G&ecirc;nante : Dysfonctionnements, fonctionnalit&eacute;s manquantes, 
          comportements inhabituels, etc. <BR>
          3. Mineur : Anomalies d'ordre cosm&eacute;tique, comme des erreurs d'orthographe 
          ou des probl&egrave;mes d'alignement graphiques <BR>
          4. Am&eacute;lioration : Demande d'ajout de fonctionnalit&eacute; ou 
          d'am&eacute;lioration. <BR>
          <P>N'accompagnez pas vos rapports d'anomalies de fichiers, notamment 
            de fontes sonores, WAV, MP3, etc., &agrave; moins que cela ne vous 
            soit demand&eacute; &agrave; des fins de diagnostic. </P>
<p> 
 	Post a message to one of our <a href=/forums.html class=fade>forums</a>
 	if you need help or experience any problems with the driver. 
 	Unfortunately, we cannot provide e-mail support.
</p>
-->
          <P>Le <? klink("forums"); ?>Forum 
            kX</A> a &eacute;t&eacute; cr&eacute;&eacute; dans l'objectif de permettre 
            aux utilisateurs de poser des questions ainsi que leur donner la possibilit&eacute; 
            d'&eacute;changer des trucs et informations entres eux. Les d&eacute;veloppeurs 
            et collaborateurs du projet kX pourront dans certains cas r&eacute;pondre 
            aux questions, mais sur une base limit&eacute;e (principalement en 
            raisons de contraintes de temps disponible). L'adresse &eacute;lectronique 
            du projet kX doit &ecirc;tre utilis&eacute;e pour les rapports d'anomalie 
            uniquement, pour le support concernant l'utilisation du produit veuillez 
            utiliser les forums kX. </P>
</h4>
