<title>FAQ</title>
<link rel="stylesheet" type="text/css" href="style.css" />
<style src="style.css"></style>

<h3>FAQ</h3>

<h4>

<b>[OUTDATED. please use English version instead]</b><br>

<br>
  <p class=Darken>G&eacute;n&eacute;ralit&eacute;s</p>
  <ul>
    <li><a href='#Q1'>Qu'est ce que le projet kX ?</a></li>
    <li><a href='#Q2'>Le pilote kX est-il gratuit ?</a></li>
    <li><a href='#Q15'>Quelles sont les cartes son utilisables avec le pilote 
      kX ?</a></li>
    <li><a href='#Q18'>Pourquoi pr&eacute;f&eacute;rer le pilote kX &agrave; ceux 
      fournis avec ma carte son ?</a></li>
    <li><a href='#Q18a'>Les pilotes kX sont ils plut&ocirc;t destin&eacute;s aux 
      musiciens, aux joueurs ou aux deux ?</a></li>
    <li><a href='#Q17'>Quels sont les syst&egrave;mes d'exploitation supportant 
      le pilote kX ?</a></li>
    <li><a href='#Q22'>Est-ce que le pilote kX supporte DirectX ?</a></li>
    <li><a href='#Q19'>Le pilote kX supporte-t-il ASIO, ASIO V2 ?</a></li>
    <li><a href='#Q21'>Obtient on un temps de latence faible dans Cakewalk's Sonar 
      ?</a></li>
    <li><a href='#Q23'>Est-ce que le pilote kX supporte des cartes sons multiples 
      ? Combien ?</a></li>
    <li><a href='#Q29'>Le mixeur standard de Windows est-il utilisable avec le 
      pilote kX ?</a></li>
    <li><a href='#Q30'>Y a-t-il un mixeur d&eacute;di&eacute; avec le pilote kX 
      ?</a></li>
    <li><a href='#Q31'>Quelles sont les possibilit&eacute;s du mixeur ? Est-il 
      possible de sauvegarder et de restaurer une configuration ?</a></li>
    <li><a href='#Q4'>Un support de GSIF est-il pr&eacute;vu ?</a></li>
    <li><a href='#Q16'>Y aura-t-il un support pour la Extigy ?</a></li>
    <li><a href='#Q5'>Pourquoi peut-on rencontrer des charges &eacute;lev&eacute;es 
      du processeur lors de l'utilisation de kX ASIO dans Logic ?</a></li>
    <li><a href='#Q6'>Pourquoi les haut-parleurs avant et arri&egrave;re sont-ils 
      invers&eacute;s par d&eacute;faut ?</a></li>
    <li><a href='#Q36'>O&ugrave; est-il possible d'obtenir un support pour le 
      pilote kX ?</a></li>
  </ul>

  <p class=Darken>Installation / D&eacute;sinstallation</p>
<ul>
    <li><a href='#Q8'>Pourquoi est-ce que Windows m'indique qu'il ne trouve pas 
      certaines DLLs quand j'essaie d'installer le pilote kX ?</a></li>
    <li><a href='#Q3'>Comment installer le pilote kX sous Windows 2000 et sous 
      Windows XP ?</a></li>   
    <li><a href='#Q9'>Comment d&eacute;sinstaller les pilotes kX ?</a></li>
    <li><a href='#Q10'>Quelle est la configuration syst&egrave;me minimale pour 
      ex&eacute;cuter le pilote kX ?</a></li>
    <li><a href='#Q8'>Pourquoi est ce que Windows m'indique que des DLLs requises 
      sont absentes lors que j'installe le pilote kX ?</a></li>
    <li><a href='#Q11'>Pourquoi est ce que le message : 'The ordinal 11 could 
      not be located in the dynamic link library DSOUND.DLL' ?</a></li>
    <li><a href='#Q13'>Pourquoi est ce qu'un message indique que kxsetup.exe est 
      link&eacute; &agrave; un export introuvable SHELL32.DLL:SHGetSpecialFolderPathA 
      ?</a></li>
</ul>

<p class=Darken>ASIO</p>
<ul>
    <li><a href='#Q19'>Est ce que le pilote kX driver supporte ASIO ? ASIOv2 ?</a></li>
    <li><a href='#Q12'>Pourquoi est ce que le message suivant appara&icirc;t : 
      "Error creating input buffer: -2147467263 (#0) [size=4096] ret=-2147467263" 
      ?</a></li>
    <li><a href='#Q20'>Quel temps de latence est-il possible d'atteindre ?</a></li>
</ul>

<p class=Darken>DSP</p>
<ul>
    <li><a href='#Q32'>Est ce que des effets DSP sont support&eacute;s par le 
      pilote kX ?</a></li>
    <li><a href='#Q33'>Y a-t-il un panneau de contr&ocirc;le des effets inclus 
      dans le pilote kX ?</a></li>
    <li><a href='#Q34'>Les nouveaux effets sont ils int&eacute;gr&eacute;s dans 
      l'application kX ?</a></li>
    <li><a href='#Q35'>Est-il possible d'&eacute;crire ses propres effets DSP 
      pour une utilisation ult&eacute;rieure dans l'application kX ?</a></li>
</ul>

  <p class=Darken>Fontes sonores</p>
<ul>
    <li><a href='#Q24'>Est-il possible d'utiliser les fontes sonores avec le pilote 
      kX ?</a></li>
    <li><a href='#Q25'>Y-a-t-il un panneau de contr&ocirc;le int&eacute;gr&eacute; 
      &agrave; l'application kX?</a></li>
    <li><a href='#Q26'>Est-il possible d'utiliser l'&eacute;diteur Vienna Soundfont 
      avec le pilote kX ?</a></li>
    <li><a href='#Q27'>Est-il possible d'utiliser l'&eacute;diteur Alive Soundfont 
      avec le pilote kX ?</a></li>
    <li><a href='#Q28'>Y a-t-il une limite de 32 Mo &agrave; l'&eacute;coute des 
      &eacute;chantillons sonores ? Est ce que cela s'applique aussi aux Audigy 
      ?</a></li>
    <li><a href='#Q39'>Pourquoi est-il impossible de charger des fontes sonores 
      volumineuses ?</a></li>
</ul>

  <p class=Darken>R&eacute;solution des probl&egrave;mes</p>
<ul>
    <li><a href='#Q7'>Pourquoi est ce que j'obtiens des gr&eacute;sillements ou 
      des corruptions de donn&eacute;es lors de la copie de fichier ou la gravure 
      de c&eacute;d&eacute;roms ? J'ai une carte m&egrave;re dot&eacute;e d'un 
      chipset VIA 686B Southbridge.</a></li>
    <li><a href='#Q8'>Pourquoi est ce que Windows m'indique qu'il manque des DLL 
      lors de l'installation du pilote kX ?</a></li>
    <li><a href='#Q11'>Pourquoi le message suivant appaira&icirc;t-il : 'The ordinal 
      11 could not be located in the dynamic link library DSOUND.DLL' ?</a></li>   
    <li><a href='#Q12'>Pourquoi est-ce que le message suivant appara&icirc;t : 
      "Error creating input buffer: -2147467263 (#0) [size=4096] ret=-2147467263" 
      ?</a></li>   
    <li><a href='#Q14'>Pourquoi est ce que Cubase provoque des erreurs irr&eacute;m&eacute;diables 
      (&Eacute;crans bleus) dans le fichier emuaps.vxd ?</a></li>   
    <li><a href='#Q13'>Pourquoi est ce que le message indiquant que kxsetup.exe 
      est link&eacute; &agrave; un export introuvable appara&icirc;t SHELL32.DLL:SHGetSpecialFolderPathA 
      ?</a></li>
    <li><a href='#Q37'>Pourquoi est ce que j'ai des probl&egrave;mes de red&eacute;marrages 
      intempestifs avec le mixeur kX ?</a></li>
    <li><a href='#Q38'>Pourquoi l'erreur 'Debug assertion failed' apparait-elle 
      ?</a></li>
    <li><a href='#Q40'>Comment configurer mon ordinateur pour obtenir des performances 
      optimales ?</a></li>
</ul>

<hr width=80%>

<a name=Q1></a>
  <p><i>Q. Qu'est ce que le projet kX ?</i></p>
  <p> R. Le projet kX est un projet enti&egrave;rement ind&eacute;pendant dont 
    l'objectif est de fournir des pilotes WDM pour les syst&egrave;mes d'exploitations 
    r&eacute;cents et les cartes compatibles-kX. Le projet kX est dirig&eacute; 
    par Eugene Gavrilov, Max Mikhailov et Hanz Petrov (une liste de tous les participants 
    peut &ecirc;tre consult&eacute; <!-- <? echo("--"); echo(">"); klink("credits"); echo("<!--"); ?>-->)ici</a>.
  </p>
<!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> <!--'; ?> -->

<a name=Q2></a>
  <p><i>Q. Le pilote kX est-il gratuit ?</i></p>  
  <p> R. Oui, le pilote kX est GRATUIT et restera GRATUIT. Vous pouvez cependant 
    supporter les efforts de d&eacute;veloppement en effectuant des donations 
    au <!-- <? echo("--"); echo(">"); klink("fund"); echo("<!--"); ?>--> fond 
    kX</a>.</p>
  <p><!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
    <!--'; ?> --> <a name=Q3></a> </p>
  <p><i>Q. Comment installer le pilote kX driver sous Windows 2000 et Windows 
    XP ?</i></p>
  <p> R. Windows 2000 et Windows XP fournissent leur propre pilote certifi&eacute; 
    pour certaines cartes audio bas&eacute;es sur l' Emu10. Notre pilote kX n'a 
    pas &eacute;t&eacute; certifi&eacute; par Microsoft et une proc&eacute;dure 
    sp&eacute;cifique d'installation est pour cela n&eacute;cessaire. Il est recommand&eacute; 
    dans un premier temps de lancer le kXSetup, et si cela ne marche pas, consultez 
    <!-- <? echo("--"); echo(">"); klink("xp"); echo("<!--"); ?>-->le Guide d'installation pour Windows XP</a>. 
  </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q4></a> 
  <p><i>Q. Y-aura-t-il un support pour le GSIF ?</i></p>
  <p> R. GSIF n'est pas un standard ouvert (que tout le monde peut suivre) et 
    nous n'avons pas acc&egrave;s aux sp&eacute;cifications officielles GSIF. 
    Si quelqu'un peut nous fournir ces sp&eacute;cifications nous essayerons d'impl&eacute;menter 
    un pilote GSIF. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q5></a> 
  <p><i>Q. Pourquoi peut-on rencontrer des taux d'utilisation du processeur &eacute;lev&eacute;s 
    lors de l'utilisation du pilote kX sous Logic ?</i></p>
  <p> R. Essayez de d&eacute;sactiver les entr&eacute;es et sorties kX ASIO inutilis&eacute;es. 
    Par d&eacute;faut Logic ouvre toutes les 16 entr&eacute;es ainsi que toutes 
    les 16 sorties. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q6></a> 
  <p><i>Q. Pourquoi les haut-parleurs avant et arri&egrave;re sont-ils invers&eacute;s 
    par d&eacute;faut ?</i></p>
  <p> R. Consultez l'explication concernant les sorties avant et arri&egrave;re 
    pour une explication d&eacute;taill&eacute;e <!-- <? echo("--"); echo(">"); klink("rear"); echo("<!--"); ?>-->ici</a>. 
  </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q7></a> 
  <p><i>Q. Pourquoi est ce que je rencontre des gr&eacute;sillements et des corruptions 
    de donn&eacute;es lors des copies de fichiers ou des gravures de c&eacute;d&eacute;roms 
    ? J'ai une carte m&egrave;re dot&eacute;e d'un chipset Southbridge VIA 686B.</i></p>
  <p> R. Veuillez consulter notre article <!-- <? echo("--"); echo(">"); klink("686b"); echo("<!--"); ?>--> 
    Probl&egrave;mes de compatibilit&eacute; entre le Via 686B Southbridge et 
    les SBLive / Audigy</a>. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q8></a> 
  <p><i>Q. Pourquoi est ce que Windows m'indique que des DLL sont absentes lorsque 
    j'essaie d'installer le pilote ?</i></p>
  <p>R. Le mixeur kX et le programme de configuration sont li&eacute;s de mani&egrave;re 
    statique &agrave; certaines biblioth&egrave;ques Windows, qui peuvent ne pas 
    se trouver sur certains syst&egrave;mes. Vous pouvez t&eacute;l&eacute;charger 
    les fichiers n&eacute;cessaires &agrave; partir de <!-- <? echo("--"); echo(">"); klink("down"); echo("<!--"); ?>--> 
    la page de t&eacute;l&eacute;chargement kX</a> si elles ne sont pas pr&eacute;sentes 
    sur votre syst&egrave;me.</p>
  <p><!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
    <!--'; ?> --> <a name=Q9></a> </p>
  <p><i>Q. Comment d&eacute;sinstaller les pilotes kX ? </i></p>
  <p>R. Ex&eacute;cutez Menu d&eacute;marrer, Programmes - kX Project - Uninstall or Re-install kX Audio Driver (Version xxxx); and click 'Remove'.
  After the driver is removed, uninstall kX Project installation files by choosing 'Uninstall kX Project Package (Version xxxx)'</p>
  </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q10></a> 
  <p><i>Q. Quelle est la configuration syst&egrave;me minimale pour faire fonctionner 
    le pilote kX ?</i></p>
  <p>R. Le pilote kX s'installera sur les syst&egrave;mes sous Microsoft Windows 
    98 Deuxi&egrave;me Edition, Windows Millenium Edition, Windows 2000 ou Windows 
    XP. Au minimum une carte Creative Labs Audigy ou bas&eacute;e sur l'Emu10k1, 
    ou bien une carte APS E-mu Systems, est &eacute;galement requise. DirectX 
    8 doit &ecirc;tre t&eacute;l&eacute;charg&eacute; et install&eacute; pr&eacute;alablement 
    &agrave; l'installation du pilote kX. Un minimum de 32 Mo de m&eacute;moire 
    RAM ainsi qu'un moniteur vid&eacute;o capable d'afficher dans les modes HiColor 
    (16 bit) or TrueColor (24bit) sont &eacute;galement hautement recommand&eacute;s 
    (en fait : n&eacute;cessaire). </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q11></a> 
  <p><i>Q. Pourquoi le message suivant s'affiche-t-il : 'The ordinal 11 could 
    not be located in the dynamic link library DSOUND.DLL' ?</i></p>
  <p>R. Vous n'avez pas install&eacute; DirectX 8. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q12></a> 
  <p><i>Q. Pourquoi le message suivant s'affiche-t-il : "Error creating input 
    buffer: -2147467263 (#0) [size=4096] ret=-2147467263" ?</i></p>
  <p>R. Vous n'avez pas positionn&eacute; l'Acc&eacute;l&eacute;ration mat&eacute;rielle 
    &agrave; 'compl&egrave;te' dans le panneau de configuration. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q13></a> 
  <p><i>Q. Pourquoi est ce que le message kxsetup.exe est link&eacute; &agrave; 
    un export manquant appara&icirc;t SHELL32.DLL:SHGetSpecialFolderPathA ?</i></p>
  <p>R. Votre syst&egrave;me d'exploitation est Windows 98 en version Lite - ce 
    syst&egrave;me n'est pas support&eacute;. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q14></a> 
  <p><i>Q. Pourquoi est-ce-que Cubase cause des Erreur d'application irr&eacute;m&eacute;diables 
    (&Eacute;crans bleus) dans le fichier emuaps.vxd ?</i></p>
  <p>R. Vous n'avez pas compl&egrave;tement d&eacute;sinstall&eacute; les pilotes 
    APS E-mu et supprim&eacute; tous les fichiers concernant l'APS dans votre 
    r&eacute;pertoire Windows\System. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q15></a> <a name='cards'></a> 
  <p><i>Q. Quelles sont les cartes son utilisables avec le pilote kX ?</i></p>
  <p>R. Actuellement, les cartes compatibles-kX comportent toutes les carte bas&eacute;es 
    sur les EMU10k1 et les EMU10k2 fabriqu&eacute;es par Creative Technology Ltd. 
    et/ou E-mu Systems Inc., notamment les cartes Live! et Live!Value d'origine 
    (CT4620 and CT4670), les Live!X-Gamer, Live!MP3+, Live!Player 1024 et Live!Platinum 
    (CT4760), les cartes Live!X-Gamer 5.1, Live!MP3+ 5.1, Live!Player 5.1, Live!Platinum 
    5.1 et Live! Digital Entertainment 5.1 (SB0060), les cartes g&eacute;n&eacute;riques 
    et sp&eacute;cifiques OEM Live (CT4830, CT4831 et CT4832), la carte Audio 
    Production Studio E-mu (APS), ainsi que la s&eacute;rie des Audigy, notamment 
    les cartes Audigy MP3+, X-Gamer, Platinum et les cartes OEM.</p>
  <p><!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
    <!--'; ?> --> <a name=Q16></a> </p>
  <p><i>Q. Y aura-t-il un support pour l'Extigy ?</i></p>
  <p>R. Pas pour l'instant. En effet l'Extigy est un p&eacute;riph&eacute;rique 
    audio USB et n'est pas actuellement compatible-kX.</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q17></a> 
  <p><i>Q. Quels sont les syst&egrave;mes d'exploitation pouvant &ecirc;tre utilis&eacute;s 
    ?</i></p>
  <p>R. Le pilote kX driver se conforme aux sp&eacute;cifications WDM (Windows 
    Driver Model), en cons&eacute;quence il est compatible avec les syst&egrave;me 
    d'exploitation Microsoft Windows suivants : Windows XP, Windows 2000, Windows 
    98 (Deuxi&egrave;me &Eacute;dition uniquement), et Windows Me. Windows 98 
    (Premi&egrave;re &Eacute;dition) ne sera pas support&eacute;.</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q18></a> 
  <p><i>Q. Pourquoi pr&eacute;f&eacute;rer le pilote kX &agrave; ceux fournis 
    avec ma carte son ?</i></p>
  <p>R. Le mixeur kX peut correspondre ou non &agrave; vos attentes particuli&egrave;res, 
    cependant vous n'avez que peu de choses &agrave; perdre en l'essayant. Le 
    pilote kX fait partie d'un projet de d&eacute;veloppement ind&eacute;pendant 
    et offre d&eacute;j&agrave; la plupart - sinon toutes - les possibilit&eacute;s 
    offertes par les pilotes du fabriquant d'origine. En fait, l'application kX 
    est continuellement mise &agrave; jour et am&eacute;lior&eacute;e, avec de 
    fr&eacute;quentes versions des pilotes et applications associ&eacute;es.</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q18></a> 
  <p><i>Q. Les pilotes kX sont-ils destin&eacute;s aux musiciens, aux joueurs 
    ou aux deux ?</i></p>
  <p>R. A l'heure actuelle le pilote kX est principalement destin&eacute; aux 
    musiciens, et plus sp&eacute;cifiquement &agrave; ceux qui souhaite obtenir 
    le maximum de leur carte son (et qui ont &eacute;t&eacute; traditionnellement 
    mis de cot&eacute; par les constructeurs de cartes sont, qui pr&eacute;f&egrave;re 
    concentrer leur efforts sur le march&eacute; des joueurs plus lucratif). Des 
    possibilit&eacute;s sp&eacute;cifiques &agrave; l'intention des joueurs seront 
    cependant int&eacute;gr&eacute;es lors du d&eacute;veloppement des pilotes.</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q19></a> 
  <p><i>Q. Le pilote kX supporte-t-il ASIO ? ASIOv2 ?</i></p>
  <p>R. ASIO v2.0 - les programmes h&ocirc;tes sont compl&egrave;tement support&eacute;s, 
    cependant, certaines fonctionalit&eacute;s ASIO2 ne sont pas impl&eacute;ment&eacute;es 
    en raison de limitations mat&eacute;rielles.</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q20></a> 
  <p><i>Q. Quel temps de latence peuvent &ecirc;tre obtenus ?</i></p>
  <p>R. Le temps de latence ASIO minimal est de 5.33 ms (&eacute;ventuellement 
    jusqu'&agrave; 2.66 ms, en fonction de la configuration mat&eacute;rielle 
    et logicielle).</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q21></a> 
  <p><i>Q. Est-il possible d'obtenir un faible latence sous Cakewalk's Sonar ?</i></p>
  <p>R. Le pilote kX est un pilote WDM de type flux/noyau (kernel-streaming), 
    des temps de latence aussi peu &eacute;lev&eacute;s que 10 ms peuvent &ecirc;tre 
    obtenus sous Sonar (en fonction de votre configuration mat&eacute;rielle/logicielle).</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q22></a> 
  <p><i>Q. Est-ce que le pilote kX incorpore le support DirectX ?</i></p>
  <p>R. Actuellement, Direct2D est compl&egrave;tement support&eacute; et Direct3D 
    est partiellement support&eacute;.</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q23></a> 
  <p><i>Q. Est-ce que le pilote kX driver supporte de multiples cartes sons ? 
    Combien ?</i></p>
  <p>R. Les cartes sons multiples sont effectivement support&eacute;es par le 
    pilote kX. Th&eacute;oriquement, un nombre illimit&eacute; de cartes son peuvent 
    &ecirc;tre utilis&eacute;es &agrave; un instant donn&eacute;, en r&eacute;alit&eacute; 
    vous serez limit&eacute; par le nombre d'emplacement PCI libres dans votre 
    machine. Toutes les combinaisons de cartes bas&eacute;es sur les EMU10K1 et/ou 
    EMU10K2 peuvent &ecirc;tre utilis&eacute;es avec le pilote kX (accompagn&eacute;e(s) 
    de cartes son de provenance d'autres constructeurs utilisant leurs propres 
    pilotes).</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q24></a> 
  <p><i>Q. Est-il possible d'utiliser les fontes sonores avec le pilote kX ?</i></p>
  <p>R. Oui, votre carte son continuera de fonctionner comme un p&eacute;riph&eacute;rique 
    compatible fonte sonore avec le pilote kX. Les fontes sonores peuvent &ecirc;tre 
    charg&eacute;es et d&eacute;charg&eacute;es par les applications compatibles 
    ou via le mixeur kX dans l'&eacute;cran fontes sonores. Actuellement seul 
    les fichiers de type SF2 sont support&eacute;s, cependant les fichiers SF1 
    (SBK) peuvent &ecirc;tre convertis en SF2 en utilisant un utilitaire disponible 
    gratuitement. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q25></a> 
  <p><i>Q. Y a-t-il un panneau de contr&ocirc;le des fontes sonores inclus dans 
    l'application ?</i></p>
  <p>R. Oui, le mixeur kX inclus un panneau de contr&ocirc;le des fontes sonores, 
    il permet de charger et de d&eacute;charger les fontes des cartes sons compatibles 
    fonctionnant avec le pilote kX.</p>
  <p><!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
    <!--'; ?> --> <a name=Q26></a> </p>
  <p><i>Q. L'&eacute;diteur Vienna Soundfont est-il utilisable avec le pilote 
    kX ?</i></p>
  <p>R. Malheureusement, l'&eacute;diteur Vienna Soundfont n'est pas compatible 
    avec le pilote kX pour l'instant en raison d'appel non document&eacute; &agrave; 
    des API. Vous pouvez cependant utiliser cet &eacute;diteur si votre syst&egrave;me 
    comporte au moins une carte son fonctionnant avec les pilotes fournis d'origine.</p>
  <p><!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
    <!--'; ?> --> <a name=Q27></a> </p>
  <p><i>Q. Est-il possible d'utiliser l'&eacute;diteur de fontes de Alive avec 
    le pilote kX ?</i></p>
  <p>R. L'&eacute;diteur Alive n'est pas enti&egrave;rement compatible avec le 
    pilote kX (une am&eacute;lioration du support est &agrave; l'&eacute;tude...)</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q28></a> 
  <p><i>Q. Y-a-t-il une limite de 32 Mo sur l'&eacute;coute des &eacute;chantillons? 
    Cette limite s'applique-t-elle aussi sur les Audigy ?</i></p>
  <p>R. La taille de l'&eacute;chantillon des fontes sonores est limit&eacute;e 
    &agrave; 32 Mo de donn&eacute;es &agrave; un instant donn&eacute;, cependant 
    des fontes de taille sup&eacute;rieure &agrave; 32 Mo peuvent &ecirc;tre charg&eacute;es. 
  </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q29></a> 
  <p><i>Q. Est-il possible d'utiliser le mixeur Windows standard avec le pilote 
    kX ?</i></p>
  <p>R. Les fonctionnalit&eacute;s de base sont disponibles, cependant le mixeur 
    audio (mixeur kX) inclus avec le pilote permet d'acc&eacute;der &agrave; de 
    nombreuses autres fonctionnalit&eacute;s. Le mixeur Windows permet d'acc&eacute;der 
    aux contr&ocirc;les suivants : G&eacute;n&eacute;ral, Audio (wave) et Synth&eacute;tiseur 
    pour l'&eacute;coute ainsi qu'aux contr&ocirc;le de niveau d'enregistrement.</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q30></a> 
  <p><i>Q. Y-a-t-il un mixeur sp&eacute;cifique inclus avec le pilote kX ?</i></p>
  <p>R. Oui, le logiciel comporte un mixeur audio dot&eacute; de nombreuses fonctionnalit&eacute;s, 
    le mixeur kX.</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q31></a> 
  <p><i>Q. Quelles sont les fonctionnalit&eacute;s du mixeur ? Est-il possible 
    de sauvegarder et de restaurer une configuration personnalis&eacute;e ?</i></p>
  <p>R. Le mixeur kX comporte des niveaux configurables pour chacune des entr&eacute;es 
    et des sorties, un contr&ocirc;le complet du codec AC97, des niveaux d'enregistrement 
    s&eacute;par&eacute;s, un mode digital s&eacute;lectionnable etc, etc.. Le 
    mixeur kX permet de sauvegarder et de restaurer toutes les options configur&eacute;es.</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q32></a> 
  <p><i>Q. Les effets DSP sont-ils support&eacute;s par le pilote kX ?</i></p>
  <p>R. Oui, le pilote kX supporte les effets DSP, la r&eacute;verb&eacute;ration 
    et le ch&#156;ur (chorus) sont charg&eacute;s par d&eacute;faut pour la compatibilit&eacute; 
    avec les synth&eacute;tiseurs MIDI.</p>
  <p><!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
    <!--'; ?> --> <a name=Q33></a> </p>
  <p><i>Q. Un panneau de contr&ocirc;le des effets est-il inclus dans l'application 
    kX ?</i></p>
  <p>R. Le mixeur kX comporte un panneau de contr&ocirc;le DSP, celui-ci permet 
    l'&eacute;dition, le chargement, la modification et le d&eacute;chargement 
    d'effets personnalis&eacute;s. Un utilitaire en mode commande est &eacute;galement 
    fourni qui permet un acc&egrave;s direct &agrave; de nombreuses fonctions.</p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q34></a> 
  <p><i>Q. De nouveaux effets sont ils inclus avec l'application kX ?</i></p>
  <p>R. Oui, en fait tous les effets inclus avec le pilote kX sont de nouveaux 
    effets personnalis&eacute;s. Actuellement : les effets suivants : R&eacute;verb&eacute;ration 
    l&eacute;g&egrave;re, Chorus St&eacute;r&eacute;o, D&eacute;lais , Overdrive, 
    M4Tube (TubeSound), Chorus, AutoWah, CL Reverb, ProLogica, RingMod, Eq10a, 
    APS Flanger, APS AutoWah, St&eacute;r&eacute;o/Mono Vocoders, Overdrive2, 
    Encode4, APS Fuzz, Mixage St&eacute;r&eacute;o, Mixage Mono, Pan, Pan x2, 
    EQ Bandpass, EQ Highpass, EQ Highshelf, EQ Lowpass, EQ Lowshelf, EQ Notch, 
    EQ Peaking, Frequency Splitter et Timbre sont inclus avec le pilote kX ; d'autres 
    effets seront disponibles dans un proche futur. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q35></a> 
  <p><i>Q. Est-il possible d'&eacute;crire ses propres effets DSP pour une utilisation 
    dans l'application kX ?</i></p>
  <p>R. Oui, l'application kX est livr&eacute;e avec un compilateur et un chargeur 
    pour le DSP, il permet aux utilisateurs chevronn&eacute;s de programmer leur 
    propres effets DSP.</p>
  <p><!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
    <!--'; ?> --> <a name=Q36></a> </p>
  <p><i>Q. O&ugrave; est-il possible d'obtenir un support pour le pilote kX ?</i></p>
  <p>R. <!-- <? echo("--"); echo(">"); klink("forums"); echo("<!--"); ?>-->Les forums kX</a>
    ont &eacute;t&eacute; cr&eacute;&eacute;s pour permettre aux utilisateurs 
    de poser des questions et d'&eacute;changer leur trucs et informations avec 
    d'autres utilisateurs. Les d&eacute;veloppeurs et collaborateurs kX r&eacute;pondrons 
    dans certains cas aux questions, sur une base limit&eacute;e (principalement 
    en raison de contrainte de temps ...). Notez bien que l'adresse de courrier 
    &eacute;lectronique du projet kX doit &ecirc;tre utilis&eacute;e pour les 
    rapports d'anomalies et les suggestions seulement, les questions relatives 
    au support doivent &ecirc;tre post&eacute;es dans les forums kX. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q37></a> 
  <p><i>Q. Pourquoi est ce que je rencontre des probl&egrave;mes de red&eacute;marrage 
    intempestifs avec le pilote kX ?</i></p>
  <p>R. C'est un probl&egrave;me connu avec Windows 2000 et Windows XP. Consultez 
    le <a href='http://support.microsoft.com/default.aspx?scid=kb;EN-US;q262575' target=_blank>site 
    de support de Microsoft </a> pour plus de d&eacute;tails. Nous conseillons 
    aux utilisateurs Windows 2000 d'installer les derniers Service Pack - cette 
    manipulation a r&eacute;solu les probl&egrave;mes de beaucoup d'utilisateurs 
    kX. </p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q38></a> 
  <p><i>Q. Pourquoi le message 'Debug assertion failed' appairait-il (Expression 
    'SUCCEEDED(hr)&&gpPicture') ?</i></p>
  <p>R. Cette erreur indique que votre installation d'Internet Explorer est corrompue. 
    Pour r&eacute;soudre ce probl&egrave;me r&eacute;installez Internet Explorer 
    5.0 (ou une version ult&eacute;rieure).</p>
  <p><!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
    <!--'; ?> --> <a name=Q39></a> </p>
  <p><i>Q. Pourquoi est-il impossible de charger des fontes sonores volumineuses 
    ?</i></p>
  <p>R. Cela provient de restrictions au niveau de la gestion m&eacute;moire de 
    Windows. Essayez de modifier les clefs de registres suivantes (pour Windows 
    2000 et Windows XP uniquement) : 
  <pre>HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Session Manager\Memory Management\
PagedPoolSize
NonPagedPoolSize
NonPagedPoolQuota
PagedPoolQuota
</pre>
  Effectuez des recherches dans notre forum et dans la base de connaissance de 
  Microsoft pour plus de d&eacute;tails. 
  <p></p>
  <!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
  <!--'; ?> --> <a name=Q40></a> 
  <p><i>Q. Comment optimiser mon syst&egrave;me pour obtenir des performances 
    optimales ?</i></p>
  <p>R. Lisez <a href=http://www.tascam.com/products/computer_recording/W2k_XP_Optimize.pdf>pdf</a> 
    et <a href=http://www.tascam.com/support/faq/pc_optimize/pcopt.pdf>pdf</a> 
    (en anglais).</p>
  <p><!-- <? print '--> <a href="#top"><img align=right src=../../images/top.gif alt="Top"></a> 
    <!--'; ?> --> </p>
</h4>
