<h3>Fond kX</h3>

<h4>

          <P>De nombreuses heures de dur labeur ont &eacute;t&eacute; d&eacute;pens&eacute;es 
            dans le cadre du projet kX jusqu'&agrave; aujourd'hui, et pourtant 
            le pilote audio kX est toujours disponible GRATUITEMENT, cependant 
            toutes les donations que vous pourriez souhaiter effectuer seront 
            grandement appr&eacute;ci&eacute;es.</P>
          <P>Bien entendu il n'y a aucune obligation d'effectuer un don - c'est 
            votre affaire - et le pilote kX restera un programme disponible librement.</P>
          <P>Cependant, si vous trouvez que les pilotes kX vous sont utiles, ou 
            simplement si vous souhaitez encourager les d&eacute;veloppeurs par 
            une participation financi&egrave;re (et que vous ayez la possibilit&eacute; 
            de le faire), alors merci d'effectuer une contribution de type PayPal/WebMoney 
            (d'un montant quelconque) au projet kX.</P>
          <P>Comme l'un de nos donateur l'a fait justement remarquer : si tous 
            les utilisateurs satisfaits de kX effectuaient m&ecirc;me simplement 
            une modeste contribution (de disons 10 € chacun), cela couvrirait 
            largement les frais et encouragerait plus encore le d&eacute;veloppement 
            de nouvelles fonctionnalit&eacute;s (et l'&eacute;limination de quelques 
            vieilles anomalies). </P>
          <P>Nous remercions vivement ceux qui ont d&eacute;j&agrave; contribu&eacute; 
            financi&egrave;rement au projet kX, gr&acirc;ce &agrave; vous, l'&eacute;quipe 
            kX a finalement obtenu une Audigy Platinum - qui va &ecirc;tre &eacute;tudi&eacute;e 
            imm&eacute;diatement - les d&eacute;veloppements qui en d&eacute;couleront 
            seront pour le b&eacute;n&eacute;fice de tous.</P>
          <P> Dans le m&ecirc;me temps, et tant que le travail continuera, le 
            r&egrave;glement des frais devra &ecirc;tre assur&eacute; (comme l'h&eacute;bergement 
            des sites Internet, etc.) et bien entendu des contributions r&eacute;guli&egrave;res 
            produiront toujours une motivation et une incitation suppl&eacute;mentaire 
            pour l'&eacute;quipe kX dans la poursuite de ce que nous avons toujours 
            fait, c'est &agrave; dire la mise &agrave; disposition de tous de 
            pilotes libres et de haute qualit&eacute; pour les cartes 10kx. </P>
          <P>Vous pouvez utiliser n'importe quelle carte de cr&eacute;dit accept&eacute;e 
            par le syst&egrave;me PayPal. (VISA, MasterCard, Discover, American 
            Express).</P>
          <P>Vous pouvez &eacute;galement utiliser le syst&egrave;me <A href="http://www.wmtransfer.com/">WebMoney 
            Transfer</A>. (Pour les utilisateurs Russes, cliquez ici : <A 
      href="http://www.webmoney.ru/">WebMoney</A>. Remarque : WebMoney vous permet 
            d'effectuer des transferts mon&eacute;taires &agrave; l'int&eacute;rieur 
            de la Russie &agrave; partir de n'importe quelle agence locale de 
            la 'Sberkassa' :). </P>
          <P>Si vous souhaitez contribuer au projet kX en achetant un espace publicitaire 
            (par exemple des banni&egrave;res publicitaires relatives &agrave; 
            des mat&eacute;riels audio ou &agrave; des logiciels associ&eacute;s 
            en haut de nos pages) alors prenez contact avec nous.</P>
          <P>En cas de probl&egrave;me ou pour toutes suggestions n'h&eacute;sitez 
            pas &agrave; prendre contact avec nous (<? contact_link(); ?>).
            <BR>
            <B>Si vous avez effectu&eacute; un don, merci d'envoyer un message 
            de confirmation &agrave; <? contact_link(1); ?>. 
            </B></P>

</h4>
