<title>Problèmes connus</title>

<h3>Problèmes connus</h3>

<h4>

<b>[might be OUTDATED. Please read English version instead]</b><br>

<p class=Darken>G&eacute;n&eacute;ralit&eacute;s</p>
<ul>
  <li>Par d&eacute;faut les sorties haut-parleurs avant et arri&egrave;re sont 
    invers&eacute;es (intentionnellement) - l'explication est <!-- <? echo("--"); echo(">"); klink("rear"); echo("<!--"); ?>-->ici</a>.</li>
  <li>EAX/EAX2.0/EAX3.0 ne sont pas compl&egrave;tement support&eacute;s.</li>
  <li>Le contr&ocirc;le de volume MIDI synth&eacute;tiseur peut ne pas fonctionner 
    en temps r&eacute;el.</li>
  <li>Si vous disposez d'un syst&egrave;me compatible ACPI il est possible de 
    vous deviez le d&eacute;sactiver l'ACPI. Voir le <!-- <? echo("--"); echo(">"); klink("acpi"); echo("<!--"); ?>--> 
    Guide ACPI</a> pour plus de d&eacute;tails.</li>
</ul>

<p class=Darken>DSP</p>
<ul>
  <li>Positionner la taille de la TRAM &agrave; 0 (bien que non recommand&eacute;) 
    peut causer des '&eacute;cran-bleus' Windows.</li>
  <li>La sortie directe de flux AC3 (passthrough) n'est pas encore impl&eacute;ment&eacute;e.</li>
</ul>

<p class=Darken>Fontes sonores (SoundFonts)</p>
<ul>
  <li>La taille maximale de l'&eacute;chantillon des fontes sonores est susceptible 
    d'&ecirc;tre limit&eacute;e par la configuration m&eacute;moire du syst&egrave;me 
    d'exploitation.</li>
</ul>

<p class=Darken>Contraintes mat&eacute;rielles</p>
<ul>
  <li>Les param&egrave;tres de phase, de niveau, etc... peuvent ne pas &ecirc;tre 
    optimis&eacute;s pour certaines formes peu commune de version du codec AC97.</li>
</ul>

<p class=Darken>Contraintes li&eacute;es aux syst&egrave;mes d'exploitation </p>
<ul>
  <li>Un ajustement particulier du panneau de contr&ocirc;le est n&eacute;cessaire 
    pour Windows 2000 (consultez le guide d'installation).</li>
  <li>Les contr&ocirc;les du mixeur Windows peuvent &ecirc;tre doubl&eacute;s 
    et un contr&ocirc;le fant&ocirc;me du c&eacute;d&eacute;rom audio est susceptible 
    d'appara&icirc;tre sous Windows 98 deuxi&egrave;me &eacute;dition seulement.</li>
</ul>

<p class=Darken>Autres logiciels</p>
<ul>
  <li>Les utilisateur du Windows Media Player peuvent parfois rencontrer un comportement 
    inattendu (par exemple saut de fichier ou passage en mode muet).</li>
  <li>L'utilisation du module d'apparence tierce-partie "Lilac" peut causer des 
    fuites de ressources (resource leakage).</li>
  <li>Certains logiciels de visualisation de programme de t&eacute;l&eacute;vision 
    (comme ceux d'ATI) peuvent g&eacute;n&eacute;rer des conflits avec le pilote 
    audio kX. Pour plus de d&eacute;tail consulter le site d'<a href='http://www.ati.com/support/infobase/4008.html' target=_blank>ATI</a>.</li>
  <li>Des probl&egrave;mes de red&eacute;marrages intempestifs peuvent se produire. 
    Pour plus de d&eacute;tails consultez le site de support de <a href='http://support.microsoft.com/default.aspx?scid=kb;EN-US;q262575' target=_blank>Microsoft</a>.</li>
</ul>

</h4>
