<title>Mission</title>
<link rel="stylesheet" type="text/css" href="style.css" />
<style src="style.css"></style>

<h3>Mission</h3>

<h4>
          <P>Nos objectifs sont de permettre aux utilisateurs finals un acc&egrave;s 
            sans restriction &agrave; toutes les fonctionnalit&eacute;s des cartes 
            son compatibles kX<? klink("faq","cards"); ?>*</A>, de promouvoir le d&eacute;veloppement 
            d'applications compatibles ainsi que d'encourager un libre &eacute;change 
            d'informations utiles pour les futurs d&eacute;veloppements du logiciel 
            pour toutes les cartes compatibles-kX. Notre devise : &quot;&Eacute;tendre 
            les potentiels, de mani&egrave;re exponentielle".</P>
          <P class=Darken>Historique</P>
          <P>Le projet kX est n&eacute; du besoin ressenti d'&eacute;tendre les 
            possibilit&eacute;s des cartes compatibles-kX pour les musiciens, 
            sous les nouveaux syst&egrave;mes d'exploitation &eacute;mergents 
            qui ne supportent plus l'ancien mod&egrave;le de pilote de type VxD.</P>    
          <P>Jusqu'&agrave; pr&eacute;sent, les musiciens int&eacute;ress&eacute;s 
            par une utilisation pouss&eacute;e des caract&eacute;ristiques techniques 
            de leurs cartes son bas&eacute;es sur les processeurs Emu10k1 et 10k2 
            avaient uniquement le choix entre l'utilisation des pilotes d'origine 
            livr&eacute;s avec leur carte<!--(drivers which have had their functionality 
severely limited by the manufacturer)-->, et l'installation de pilotes VxD - de 
            meilleure qualit&eacute; - con&ccedil;us pour les cartes APS de E-mu 
            Systems, mais ils n'&eacute;taient plus en mesure dans ce cas d'&eacute;voluer 
            vers les nouvelles versions des syst&egrave;mes d'exploitation. Dans 
            certains cas, des utilisateurs ont d&eacute;cid&eacute; de changer 
            compl&egrave;tement de syst&egrave;me d'exploitation, en passant par 
            exemple &agrave; Linux, ou ont limit&eacute; l'utilisation de leur 
            carte son 10kx &agrave; des applications ludiques ou &agrave; l'utilisation 
            des fontes sonores. </P>
          <P><!--Understanding the need, and with the open-source linux drivers providing a working 
model, a-->Un d&eacute;veloppeur ind&eacute;pendant d&eacute;cida au printemps 
            2001 d'&eacute;crire un pilote WDM qui rendrait le pouvoir aux mains 
            des utilisateurs finals, et ouvrirait la porte &agrave; des d&eacute;veloppements 
            logiciels illimit&eacute;s pour les cartes 10kx. Cet implacable et 
            intr&eacute;pide d&eacute;veloppeur &eacute;tait Eug&egrave;ne Gavrilov, 
            qui continue aujourd'hui &agrave; &ecirc;tre le fer de lance de l'effort 
            de programmation autour du pilote kX.</P>
          <P>Une petite &eacute;quipe de testeurs et de d&eacute;veloppeurs ont 
            aujourd'hui rejoint Eug&egrave;ne pour poursuivre le d&eacute;veloppement 
            du projet kX. En travaillant ensemble nous pouvons et nous r&eacute;ussirons 
            &agrave; &eacute;tendre le Potentiel et nous permettront aux utilisateurs 
            finals d'obtenir un contr&ocirc;le sans pr&eacute;c&eacute;dent de 
            leurs cartes son ainsi qu'&agrave; d&eacute;velopper des outils pour 
            les musiciens et par des musiciens.<!--, without concern for market share or the bottom line.--></P>
</h4>

          <H5><I>- Hanz Petrov, Eug&egrave;ne Gavrilov<BR>
            D&eacute;cembre, 2001</I> </H5>
