<title>Probl&egrave;mes concernant les sorties avants/arri&egrave;res</title>

<link rel="stylesheet" type="text/css" href="style.css" />
<style src="style.css"></style>

<h3>Probl&egrave;mes concernant les sorties avants/arri&egrave;res</h3>

<h4>

          <P>Ces probl&egrave;mes concernent toutes les cartes Creative, mais 
            pas les APS E-mu. Les cartes Creative audio bas&eacute;es sur le DSP 
            audio Emu10kX n&eacute;cessite un DAC (Convertisseur digital/analogique 
            - Digital to Analog Converter) pour produire une sortie analogique. 
            En g&eacute;n&eacute;ral, cette t&acirc;che est effectu&eacute;e soit 
            par les Codecs AC97 soit par les Codecs I2S.</P>
          <P>Les cartes Creative utilisent le codec AC97 pour les sorties avants 
            et la centrale/caisson de basse, et le codec I2S pour les sorties 
            arri&egrave;res. Le codec AC97 est &eacute;galement utilis&eacute; 
            comme ADC (Convertisseur analogique/digital - Analog to Digital Converter) 
            et est ainsi responsable de la gestion de toutes les entr&eacute;es 
            analogiques int&eacute;gr&eacute;es. (Remarque : les baies LiveDrives 
            et autres cartes filles peuvent utiliser des sch&eacute;mas diff&eacute;rents). 
          </P>
          <P>Les codecs AC97 utilis&eacute;s par les cartes SBLive! sont quelque 
            peu bruit&eacute;s (en comparaison avec les codecs i2s), et cela entra&icirc;ne 
            des probl&egrave;mes de qualit&eacute;. Les sorties arri&egrave;res 
            des SBLive sont donc dot&eacute;es d'un meilleur rapport signal/bruit 
            [Signal To Noise Ratio (SNR)], d'un meilleur taux de distorsion harmonique 
            totale [Total Harmonic Distortion (THD)] ainsi que de la s&eacute;paration 
            des canaux [Channel Separation (acs)] puisqu'elles utilisent le code 
            I2S. Donc, si vous souhaitez obtenir une meilleure qualit&eacute; 
            sonore en diffusion musicale, nous vous recommandons de connecter 
            vos haut-parleurs &agrave; la sortie 'Sortie Arri&egrave;re / Rear 
            Out' et d'activer l'option 'Inverser les haut-parleurs avant/arri&egrave;re' 
            dans le Mixeur kX (cette option est activ&eacute;e par d&eacute;faut).</P>    
          <P>Les cartes Audigy utilisent &agrave; la fois les codecs AC97 et I2S 
            pour les sorties avant et donnent donc th&eacute;oriquement une bonne 
            qualit&eacute; aux sorties avant. Cependant le codec AC97 cause une 
            certaine distorsion, la m&ecirc;me proc&eacute;dure est donc &eacute;galement 
            recommand&eacute;e pour les cartes Audigy. </P>
          <P>Bien entendu les informations ci-dessus doivent &ecirc;tre consid&eacute;r&eacute;es 
            comme des recommandations seulement. </P>
</h4>
