<title>Les fontes sonores</title>

<link rel="stylesheet" type="text/css" href="style.css" />
<style src="style.css"></style>

<p><b><font face="Arial"><img  src="images/soundfont_s.gif" > 
  Les fontes sonores (SoundFonts)</font></b></p>
<hr>
<p><font size="2" face="Arial">Le mixeur kX permet de charger des fontes sonores 
  en vue de leur utilisation par des synth&eacute;tiseurs MIDI.</font></p>
<p><font size="2" face="Arial">Pour charger une fonte sonore cliquez sur le bouton 
  <img  src="images/sfload_o.gif" > dans l'&eacute;cran 
  fontes sonores. Une boite de dialogue appara&icirc;tra o&ugrave; vous pourrez 
  s&eacute;lectionner le fichier de fontes &agrave; charger (extensions de type 
  .SF2).</font></p>
<p><font size="2" face="Arial">Les fontes sonores actuellement charg&eacute;es 
  sont list&eacute;es dans le panneau sup&eacute;rieur. La s&eacute;lection d'une 
  fonte dans ce panneau fait appara&icirc;tre les informations la concernant dans 
  le panneau inf&eacute;rieur, notamment : nom, moteur, copyright, ing&eacute;nieur 
  et statistiques.</font></p>
<p><font size="2" face="Arial">L'utilisation m&eacute;moire est affich&eacute;e 
  dans la barre<i> Memory Usage</i> en bas de l'&eacute;cran.</font></p>
<p><font size="2" face="Arial">Pour d&eacute;charger une fonte, s&eacute;lectionner 
  la dans le panneau sup&eacute;rieur puis cliquer sur l'ic&ocirc;ne :<img  src="images/quit.gif" >.</font></p>
<p><font size="2" face="Arial">Le pilote kX supporte le chargement de fontes de 
  types 2.0 et 2.1 uniquement, les fontes de type 1.0 (format .SBK) ne sont pas 
  support&eacute;es. Il n'y a pas de support des propri&eacute;t&eacute;s de modulation 
  des Sf 21.</font></p>
<p><font size="2" face="Arial">Le pilote WDM kX affecte les fontes en m&eacute;moire 
  cache &agrave; la demande ; il n'y a pas de contr&ocirc;le du cache pouvant 
  &ecirc;tre ajust&eacute; par l'utilisateur. Th&eacute;oriquement la taille maximale 
  des fontes pouvant &ecirc;tre charg&eacute;es est limit&eacute;e uniquement 
  par les ressources syst&egrave;me, cependant ce maximum varie entre 30 et 70% 
  de la m&eacute;moire physique RAM, en raison de limitations dues &agrave; la 
  gestion m&eacute;moire du noyau ainsi qu'&agrave; d'autres facteurs. Dans tous 
  les cas seul 32 Mo d'&eacute;chantillons peuvent &ecirc;tre utilis&eacute;s 
  simultan&eacute;ment en raison de limitations mat&eacute;rielles.</font></p>
